# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "beeftornado/rmtree"
tap "microsoft/git"
tap "tavianator/tap"

# Development Tools
brew "ccache"
brew "cmake"
brew "pkg-config"

# Libraries
brew "gdbm"
brew "gettext"
brew "gmp"
brew "openssl@1.1"
brew "readline"

# User Programs
brew "age"
brew "asciinema"
brew "bat"
brew "bfs"
brew "caddy"
brew "chezmoi"
brew "croc"
brew "ctags"
brew "curl"
brew "curlie"
brew "direnv"
brew "diskus"
brew "dust"
brew "exa"
brew "fd"
brew "fish"
brew "fzf"
brew "gdb"
brew "gh"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "git-interactive-rebase-tool"
brew "git-lfs"
brew "go"
brew "hexyl"
brew "htop"
brew "hyperfine"
brew "jq"
brew "less"
brew "lftp"
brew "mas"
brew "mkcert"
brew "mosh"
brew "mycli"
brew "neovim"
brew "openssh"
brew "pgcli"
cask "git-credential-manager-core"
brew "pipx"
brew "pre-commit"
brew "rclone"
brew "ripgrep"
brew "sd"
brew "shellcheck"
brew "socat"
brew "starship"
brew "svn"
brew "tealdeer"
brew "terminal-notifier"
brew "thefuck"
brew "tmate"
brew "tmux"
brew "tokei"
brew "trash"
brew "vivid"
brew "watch"
brew "watchexec"
brew "yubikey-agent"
brew "zoxide"

# GUI Software
cask "1password-beta"
cask "1password-cli"
cask "keka"
cask "kekaexternalhelper"
mas "Xcode", id: 497799835
cask "alacritty"
cask "docker"
cask "iterm2"
cask "visual-studio-code"
cask "hot"
cask "silicon"
cask "font-source-code-pro"
mas "Amphetamine", id: 937984704
cask "flux"
cask "hex-fiend"
mas "PCalc", id: 403504866
mas "Boop", id: 1518425043
mas "ColorSlurp", id: 1287239339
cask "serial"
cask "dash"
cask "maccy"
cask "rectangle"
