oh-my-fish/plugin-bang-bang
edc/bass
fisherman/fzf
fisherman/nvm
neersighted/pyenv@patch-1
neersighted/rbenv@patch-1
oh-my-fish/plugin-sudope
fisherman/z
