oh-my-fish/plugin-bang-bang
edc/bass
0rax/fish-bd
fisherman/fzf
fisherman/pipenv
oh-my-fish/plugin-sudope
fisherman/z
laughedelic/brew-completions
