{
  "plugins": {
    "SchemaStore.nvim": {
      "src": "https://github.com/b0o/SchemaStore.nvim"
    },
    "aerial.nvim": {
      "src": "https://github.com/stevearc/aerial.nvim"
    },
    "bufferline.nvim": {
      "src": "https://github.com/akinsho/bufferline.nvim"
    },
    "chezmoi.vim": {
      "src": "https://github.com/alker0/chezmoi.vim"
    },
    "conform.nvim": {
      "src": "https://github.com/stevearc/conform.nvim"
    },
    "direnv.nvim": {
      "src": "https://github.com/NotAShelf/direnv.nvim"
    },
    "fzf-lua": {
      "src": "https://github.com/ibhagwan/fzf-lua"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim"
    },
    "guess-indent.nvim": {
      "src": "https://github.com/NMAC427/guess-indent.nvim"
    },
    "i3config.vim": {
      "src": "https://github.com/mboughaba/i3config.vim"
    },
    "indent-blankline.nvim": {
      "src": "https://github.com/lukas-reineke/indent-blankline.nvim"
    },
    "leap.nvim": {
      "src": "https://codeberg.org/andyg/leap.nvim"
    },
    "lexima.vim": {
      "src": "https://github.com/cohama/lexima.vim"
    },
    "lualine.nvim": {
      "src": "https://github.com/nvim-lualine/lualine.nvim"
    },
    "mini.align": {
      "src": "https://github.com/nvim-mini/mini.align"
    },
    "mini.bracketed": {
      "src": "https://github.com/nvim-mini/mini.bracketed"
    },
    "mini.hipatterns": {
      "src": "https://github.com/nvim-mini/mini.hipatterns"
    },
    "mini.move": {
      "src": "https://github.com/nvim-mini/mini.move"
    },
    "mini.splitjoin": {
      "src": "https://github.com/nvim-mini/mini.splitjoin"
    },
    "mini.starter": {
      "src": "https://github.com/nvim-mini/mini.starter"
    },
    "mini.surround": {
      "src": "https://github.com/nvim-mini/mini.surround"
    },
    "neoscroll.nvim": {
      "src": "https://github.com/karb94/neoscroll.nvim"
    },
    "nord.nvim": {
      "src": "https://github.com/gbprod/nord.nvim"
    },
    "nvim-treesitter-textobjects": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-textobjects",
      "version": "'main'"
    },
    "nvim-ts-autotag": {
      "src": "https://github.com/windwp/nvim-ts-autotag"
    },
    "rainbow-delimiters.nvim": {
      "src": "https://github.com/HiPhish/rainbow-delimiters.nvim"
    },
    "smart-splits.nvim": {
      "src": "https://github.com/mrjones2014/smart-splits.nvim"
    },
    "switch.vim": {
      "src": "https://github.com/AndrewRadev/switch.vim"
    },
    "tree-sitter-manager.nvim": {
      "src": "https://github.com/romus204/tree-sitter-manager.nvim"
    },
    "undotree": {
      "src": "https://github.com/jiaoshijie/undotree"
    },
    "vim-dirvish": {
      "src": "https://github.com/justinmk/vim-dirvish"
    },
    "vim-eunuch": {
      "src": "https://github.com/tpope/vim-eunuch"
    },
    "vim-fugitive": {
      "src": "https://github.com/tpope/vim-fugitive"
    },
    "vim-matchup": {
      "src": "https://github.com/andymass/vim-matchup"
    },
    "vim-peekaboo": {
      "src": "https://github.com/junegunn/vim-peekaboo"
    },
    "vim-repeat": {
      "src": "https://github.com/tpope/vim-repeat"
    },
    "vim-slash": {
      "src": "https://github.com/junegunn/vim-slash"
    },
    "vim-startuptime": {
      "src": "https://github.com/dstein64/vim-startuptime"
    },
    "vim-wordmotion": {
      "src": "https://github.com/chaoren/vim-wordmotion"
    },
    "yanky.nvim": {
      "src": "https://github.com/gbprod/yanky.nvim"
    },
    "zoxide.vim": {
      "src": "https://github.com/nanotee/zoxide.vim"
    }
  }
}
